Table of Contents
 Class IdeaConnectionController
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class IdeaConnectionController : IDisposable, IConnectionController
Inheritance
object
IdeaConnectionController
Implements
IDisposable
IConnectionController
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaConnectionController(string, IPluginLogger)
protected IdeaConnectionController(string ideaInstallDir, IPluginLogger logger)
Parameters
ideaInstallDir string
logger IPluginLogger
Fields
 CurrentItemChangedEvent
protected EventWaitHandle CurrentItemChangedEvent
Field Value
EventWaitHandle
Properties
 GrpcClient
protected AutomationHostingGrpc<IAutomation, IAutomation> GrpcClient { get; set; }
Property Value
AutomationHostingGrpc<IAutomation, IAutomation>
 UserMode
protected virtual uint UserMode { get; }
Property Value
uint
Methods
 CloseProject()
Close the open project
public int CloseProject()
Returns
int
 Create(string)
Creates connection and starts IDEA StatiCa connection application. Call OpenProject after this method to open specific project.
public static IConnectionController Create(string ideaInstallDir)
Parameters
ideaInstallDir string
IDEA StatiCa installation directory.
Returns
IConnectionController
A controller object.
 Create(string, IPluginLogger)
Creates connection and starts IDEA StatiCa connection application. Call OpenProject after this method to open specific project.
public static IConnectionController Create(string ideaInstallDir, IPluginLogger logger)
Parameters
ideaInstallDir string
IDEA StatiCa installation directory.
logger IPluginLogger
The pluginLogger.
Returns
IConnectionController
A controller object.
 Dispose()
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
public void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool disposing)
Parameters
disposing bool
 GenerateReport(int, ConnReportSettings)
public IBlobStorage GenerateReport(int conId, ConnReportSettings settings)
Parameters
conId int
settings ConnReportSettings
Returns
IBlobStorage
 OpenConnectionClient()
protected void OpenConnectionClient()
 OpenProject(string)
Open idea con project in IdeaConnection
public int OpenProject(string fileName)
Parameters
fileName string
The file path to the ideaCon.
Returns
int
Events
 ConnectionAppExited
Fires when IdeaConnection app exited.
public event EventHandler ConnectionAppExited
Event Type
EventHandler
 Edit this page